1. 生成可执行文件的时候，需要加上参数 -g来编译，
 -g： 会保留函数名和变量名 ：例如： gcc a.c b.c -o app -g

2. 启动gdb  命令：gdb app
	如果程序是带参数的，可以给程序传参：set args xxx xxx 后面是程序运行所需要的参数，参数自定义
	
	r:查看执行结果；
	l:显示main文件里面的代码，默认显示10行，可以通过命令查看：show listsize;  也可以通过命令来设置显示多少行 set listsize 20 ;设置显示为20行 , 查看当前目录别的文件的信息 l 文件名：行号
	例如： l sub.c:9 ; 后面也可以加函数内套用的函数。
	
3.  查看当前的文件： l 或者 l 行号  l 函数名
	查看非当前文件: l 文件名：行号 或者 l 文件名:函数名 	
	显示行数： show listsize;
	设置行数: set listsize;
	
4. 设置断点： (break) 简写为 b 加行号 或者 b 函数名  例如： b 9; 或者在设置别的文件的断点： b 文件名： 行号 或者 b 文件名：函数
	查看设置的断点：info b; 简写为 i b;
	删除断点： del 断点的编号 简写为： d 1; 也可以一起删 del 2,3 4 ;
	设置断点为无效断点：dis 断点编号 ，dis 1；断点就无效了 恢复断点生效：ena 断点编号 ,ena 1;
	
	设置条件断点： b 17 if i==10 设置第17行打断点，     设置条件i==10，当执行到i=10的时候，断点生效， 查看i的值命令： p i 即打印i的值 
	
5.调试相关的命令：
	run 简写 r 让程序运行
	p 查看变量的值 即打印 p i 或者 p len
	ptype 查看变量的类型  ptype i 是int型的
	next  简写 n 向下运行一行代码 ,单步调试，遇到函数不会进入到函数体
	display 显示需要的信息，下面运行程序就会打印需要显示的信息
	undisplay  不显示需要的信息，开了多个显示的话，关闭显示的时候就得加关闭的编号 undisplay 1;
	continue 简写 c  运行多步 直到下一个断点停下 可以简写 c
	step 简写 s   跳转到函数体的内部，也可以单步调试，但是遇到函数会进入函数体内部
	finish 从函数体内部跳转到主函数，位置为进程函数体当时的位置，跳回到以前进入函数体内部的位置。
	
	start  会停在主函数的运行的开始位置，程序也运行起来了的
	
	set var i=5  设置变量i的值为5，直接看i=5的时候的情况。
	
	until  可以跳出循环，但是断点必须要被删除，这样就会跳出循环。
	
	quit  简写 q  退出调试 .

