

内存管理是指软件运行时对计算机内存资源的分配和使用的技术。其最主要的目的是如何高效，快速的分配计算机内存资源，并且在适当的时候释放和回收内存资源。

内存分区
分区里面的数据结构

运行可执行程序，操作系统把物理硬盘程序load(加载)到内存
一般情况下程序存放在Rom或Flash中，运行时需要拷到内存中执行，内存会分别存储不同的信息。

C代码经过预处理、编译、汇编、链接4步后生成一个可执行程序

预处理：头文件展开，宏定义替换，条件编译，不做语法检查
编译：将预处理后的文件进一步翻译，变成汇编文件，做语法检查

预处理和编译后的文件是不会占用内存的资源的，程序是放在磁盘空间内。

汇编：将汇编代码进一步翻译，变成目标文件 .o的文件，即二进制文件

汇编之后生成了.o 的文件，目标文件就会占用一些内存的资源，可以通过size a.o查看文件占用自愿的情况。
汇编后data区为0，
链接：链接动态库，生成可执行的文件
链接后data区才有大小
内存分区：堆区，栈区，全局区，代码区；

zilong@zilong-virtual-machine:~/test/pthread$ size pthread.o
   text	   data	    bss	    dec	    hex	filename
    446	      0	      4	    450	    1c2	pthread.o
zilong@zilong-virtual-machine:~/test/pthread$ size a.out 
   text	   data	    bss	    dec	    hex	filename
   2163	    616	      8	   2787	    ae3	a.out
   
  text：代码区
  data:静态数据或全局初始化数据区
  bss:未初始化数据区
  dec：十进制总和
  hex：十六进制总和
  filename:文件名
 程序没运行，即程序未执行：代码区，数据区和未初始化数据区，后面两个也叫全局区或静态区。其实全局区里面还有一个文字常量区的，文件常量区放字符串常量的
 代码区：放可执行的代码，二进制文件
 已初始化数据区：放已初始化的全局变量，静态变量，和常量数据
 未初始化数据区：未初始化的全局变量，未初始化的静态变量
 
 程序在加载到内存前，代码区和全局区(data和bss)的大小就是固定的，程序运行期间不能改变
 
 程序在执行过程中：
 代码区：放可执行的代码，二进制文件
 数据区或者全局区：
		未初始数据：未初始化的全局变量，未初始化的静态变量
		初始化数据：放已初始化的全局变量，静态变量，和常量数据
		文字常量区：放字符串常量
		
 堆区：手动申请，存放用户申请的空间的数据
        如果程序没有结束，用户没有free, 堆区空间不释放
		用链表来存储的空闲内存地址的，自然是不连续的，而链表的遍历方向是由低地址向高地址
		数据结构是链表

 
 栈区：函数参数，返回值，局部变量等
 局部变量，自动分配空间，自动释放
	   是一块连续的内存的区域
	   数据结构是一块连续的内存空间
	   
堆栈是一种简单的数据结构，是一种只允许在其一端进行插入或删除的线性表

数据结构的栈和堆
栈就像装数据的桶或箱子
我们先从大家比较熟悉的栈说起吧，它是一种具有后进先出性质的数据结构，也就是说后存放的先取，先存放的后取。
堆像一棵倒过来的树
而堆就不同了，堆是一种经过排序的树形数据结构，每个结点都有一个值。通常我们所说的堆的数据结构，是指二叉堆。堆的特点是根结点的值最小（或最大），且根结点的两个子树也是一个堆。由于堆的这个特性，常用来实现优先队列，堆的存取是随意。

内存分配中的栈和堆
	一般情况下程序存放在Rom或Flash中，运行时需要拷到内存中执行，内存会分别存储不同的信息。
	内存中的栈区处于相对较高的地址以地址的增长方向为上的话，栈地址是向下增长的。

栈中分配局部变量空间，堆区是向上增长的用于分配程序员申请的内存空间。
	   
普通局部变量：
    1、作用域属于某个{}， 离开{}不能使用
    2、执行到定义变量那句话，才会分配空间和初始化，没有初始化，值为随机数
    3、离开作用域，自动释放，释放不是空间消失，是这个空间用户无法再使用

static局部变量：
    1、作用域属于某个{}， 离开{}不能直接使用，可以通过指针间接使用
    2、main调用前，就已经分配空间和初始化，没有初始化，值为0
    3、整个程序结束，才释放

static全局变量:
    1、static限定了变量的使用范围，只能在本文件，而且是定义变量以后的代码使用此变量
    2、每个文件可以定义一次static全局变量
    3、main调用前，就已经分配空间和初始化，没有初始化，值为0
    4、整个程序结束，才释放

普通全局变量：
    1、只要定义了，任何地方都能使用，前提要声明
    2、所有文件只能定义一次全局变量
    3、main调用前，就已经分配空间和初始化，没有初始化，值为0
    4、整个程序结束，才释放

 

